tutorials/Lagrangian/coalChemistryFoam/simplifiedSiwek/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel        kEpsilon;

turbulence      on;

laminarCoeffs
{
}

kEpsilonCoeffs
{
    Cmu             0.09;
    C1              1.44;
    C2              1.92;
    C3              -0.33;
    alphah          1;
    alphak          1;
    alphaEps        0.76923;
}

RNGkEpsilonCoeffs
{
}

LaunderSharmaKECoeffs
{
}

LRRCoeffs
{
}

LaunderGibsonRSTMCoeffs
{
}

wallFunctionCoeffs
{
    kappa           0.4187;
    E               9;
}


// ************************************************************************* //
